---
kind: type
id: T:Autodesk.Revit.DB.Events.ViewPrintingEventArgs
source: html/8e7d048f-a50b-7903-6001-6716f7eabdb5.htm
---
# Autodesk.Revit.DB.Events.ViewPrintingEventArgs

The event arguments used by the ViewPrinting event.

## Syntax (C#)
```csharp
public class ViewPrintingEventArgs : RevitAPIPreDocEventArgs
```